joristork/robots/jobot_in_c/microchip_extras/h/p18f8585.h
extern volatile far  unsigned char       B3SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B3SIDHbits;
extern volatile far  unsigned char       B3SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXID:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXIDE:1;
  };
} B3SIDLbits;
extern volatile far  unsigned char       B3EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B3EIDHbits;
extern volatile far  unsigned char       B3EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B3EIDLbits;
extern volatile far  unsigned char       B3DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR:1;
  };
  struct {
    unsigned :4;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
    unsigned TXRTR:1;
  };
} B3DLCbits;
extern volatile far  unsigned char       B3D0;
extern volatile far  struct {
  unsigned B3D00:1;
  unsigned B3D01:1;
  unsigned B3D02:1;
  unsigned B3D03:1;
  unsigned B3D04:1;
  unsigned B3D05:1;
  unsigned B3D06:1;
  unsigned B3D07:1;
} B3D0bits;
extern volatile far  unsigned char       B3D1;
extern volatile far  struct {
  unsigned B3D10:1;
  unsigned B3D11:1;
  unsigned B3D12:1;
  unsigned B3D13:1;
  unsigned B3D14:1;
  unsigned B3D15:1;
  unsigned B3D16:1;
  unsigned B3D17:1;
} B3D1bits;
extern volatile far  unsigned char       B3D2;
extern volatile far  struct {
  unsigned B3D20:1;
  unsigned B3D21:1;
  unsigned B3D22:1;
  unsigned B3D23:1;
  unsigned B3D24:1;
  unsigned B3D25:1;
  unsigned B3D26:1;
  unsigned B3D27:1;
} B3D2bits;
extern volatile far  unsigned char       B3D3;
extern volatile far  struct {
  unsigned B3D30:1;
  unsigned B3D31:1;
  unsigned B3D32:1;
  unsigned B3D33:1;
  unsigned B3D34:1;
  unsigned B3D35:1;
  unsigned B3D36:1;
  unsigned B3D37:1;
} B3D3bits;
extern volatile far  unsigned char       B3D4;
extern volatile far  struct {
  unsigned B3D40:1;
  unsigned B3D41:1;
  unsigned B3D42:1;
  unsigned B3D43:1;
  unsigned B3D44:1;
  unsigned B3D45:1;
  unsigned B3D46:1;
  unsigned B3D47:1;
} B3D4bits;
extern volatile far  unsigned char       B3D5;
extern volatile far  struct {
  unsigned B3D50:1;
  unsigned B3D51:1;
  unsigned B3D52:1;
  unsigned B3D53:1;
  unsigned B3D54:1;
  unsigned B3D55:1;
  unsigned B3D56:1;
  unsigned B3D57:1;
} B3D5bits;
extern volatile far  unsigned char       B3D6;
extern volatile far  struct {
  unsigned B3D60:1;
  unsigned B3D61:1;
  unsigned B3D62:1;
  unsigned B3D63:1;
  unsigned B3D64:1;
  unsigned B3D65:1;
  unsigned B3D66:1;
  unsigned B3D67:1;
} B3D6bits;
extern volatile far  unsigned char       B3D7;
extern volatile far  struct {
  unsigned B3D70:1;
  unsigned B3D71:1;
  unsigned B3D72:1;
  unsigned B3D73:1;
  unsigned B3D74:1;
  unsigned B3D75:1;
  unsigned B3D76:1;
  unsigned B3D77:1;
} B3D7bits;
extern volatile far  unsigned char       CANSTAT_RO6;
extern volatile far  struct {
  unsigned EICODE0:1;
  unsigned EICODE1_ICODE0:1;
  unsigned EICODE2_ICODE1:1;
  unsigned EICODE3_ICODE2:1;
  unsigned EICODE4:1;
  unsigned OPMODE0:1;
  unsigned OPMODE1:1;
  unsigned OPMODE2:1;
} CANSTAT_RO6bits;
extern volatile far  unsigned char       CANCON_RO6;
extern volatile far  struct {
  unsigned FP0:1;
  unsigned WIN0_FP1:1;
  unsigned WIN1_FP2:1;
  unsigned WIN2_FP3:1;
  unsigned ABAT:1;
  unsigned REQOP0:1;
  unsigned REQOP1:1;
  unsigned REQOP2:1;
} CANCON_RO6bits;
extern volatile far  unsigned char       B4CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
} B4CONbits;
extern volatile far  unsigned char       B4SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B4SIDHbits;
extern volatile far  unsigned char       B4SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXID:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXIDE:1;
  };
} B4SIDLbits;
extern volatile far  unsigned char       B4EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B4EIDHbits;
extern volatile far  unsigned char       B4EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B4EIDLbits;
extern volatile far  unsigned char       B4DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR:1;
  };
  struct {
    unsigned :4;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
    unsigned TXRTR:1;
  };
} B4DLCbits;
extern volatile far  unsigned char       B4D0;
extern volatile far  struct {
  unsigned B4D00:1;
  unsigned B4D01:1;
  unsigned B4D02:1;
  unsigned B4D03:1;
  unsigned B4D04:1;
  unsigned B4D05:1;
  unsigned B4D06:1;
  unsigned B4D07:1;
} B4D0bits;
